<?php

	/*	二維陣列的範例

		此例使用 array() 函式的方式來宣告陣列

	*/

	$student = array(array('學號'=>101, '姓名'=>'李雲毓', '性別'=>'女', '生日'=>'2000/3/14', '電話'=>'(02)2704-2762'),
		array('學號'=>102, '姓名'=>'黃冠尼', '性別'=>'女', '生日'=>'2000/5/2', '電話'=>'(02)2712-4457'),
		array('學號'=>103, '姓名'=>'為國書', '性別'=>'男', '生日'=>'2000/8/14', '電話'=>'(04)2745-5524'),
		array('學號'=>104, '姓名'=>'劉子芸', '性別'=>'女', '生日'=>'2000/7/6', '電話'=>'(03)2741-6631'),
		array('學號'=>105, '姓名'=>'李正雲', '性別'=>'男', '生日'=>'2000/6/25', '電話'=>'(04)2547-6630')
		);

	echo "學號：" . $student[0]['學號']. "<br />";
	echo "姓名：" . $student[0]['姓名']. "<br />";
	echo "性別：" . $student[0]['性別']. "<br />";
	echo "生日：" . $student[0]['生日']. "<br />";
	echo "電話：" . $student[0]['電話'];

?>	