<?php

	// 利用 array() 建構一個二維陣列，紀錄4個學生的成績資料，再利用 foreach() 將每個學生的資料顯示出來。

	$student = array(array('學號'=>101, '姓名'=>'李雲毓', '性別'=>'女', '生日'=>'2000/3/14', '電話'=>'(02)2751-4456'),
		array('學號'=>102, '姓名'=>'黃冠尼', '性別'=>'女', '生日'=>'2000/5/14', '電話'=>'(02)2563-7741'),
		array('學號'=>103, '姓名'=>'維果蔬', '性別'=>'男', '生日'=>'2000/6/11', '電話'=>'(02)2136-0021'),
		array('學號'=>104, '姓名'=>'劉子芸', '性別'=>'女', '生日'=>'2000/1/22', '電話'=>'(04)4421-0045'),
		array('學號'=>105, '姓名'=>'李正雲', '性別'=>'男', '生日'=>'2000/8/14', '電話'=>'(02)2154-6214'),
		);

	foreach ($student as $sdata) {
		
		echo "學號：". $sdata['學號'] . "，" ;
		echo "姓名：". $sdata['姓名'] . "，" ;
		echo "性別：". $sdata['性別'] . "，" ;
		echo "生日：". $sdata['生日'] . "，" ;
		echo "電話：". $sdata['電話'] . "。 <br />" ;

	}

?>	